{
  "_name_or_path": "microsoft/beit-base-patch16-384",
  "add_fpn": false,
  "architectures": [
    "BeitForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "ABE",
    "1": "ART",
    "2": "BAS",
    "3": "BLA",
    "4": "EBO",
    "5": "EOS",
    "6": "FGC",
    "7": "HAC",
    "8": "KSC",
    "9": "LYI",
    "10": "LYT",
    "11": "MMZ",
    "12": "MON",
    "13": "MYB",
    "14": "NGB",
    "15": "NGS",
    "16": "NIF",
    "17": "OTH",
    "18": "PEB",
    "19": "PLM",
    "20": "PMO"
  },
  "image_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ABE": 0,
    "ART": 1,
    "BAS": 2,
    "BLA": 3,
    "EBO": 4,
    "EOS": 5,
    "FGC": 6,
    "HAC": 7,
    "KSC": 8,
    "LYI": 9,
    "LYT": 10,
    "MMZ": 11,
    "MON": 12,
    "MYB": 13,
    "NGB": 14,
    "NGS": 15,
    "NIF": 16,
    "OTH": 17,
    "PEB": 18,
    "PLM": 19,
    "PMO": 20
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 0.1,
  "model_type": "beit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "out_features": [
    "stage12"
  ],
  "out_indices": [
    12
  ],
  "patch_size": 16,
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "problem_type": "single_label_classification",
  "reshape_hidden_states": true,
  "semantic_loss_ignore_index": 255,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7",
    "stage8",
    "stage9",
    "stage10",
    "stage11",
    "stage12"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.36.0.dev0",
  "use_absolute_position_embeddings": false,
  "use_auxiliary_head": true,
  "use_mask_token": false,
  "use_mean_pooling": true,
  "use_relative_position_bias": true,
  "use_shared_relative_position_bias": false,
  "vocab_size": 8192
}
